The  DockablePaneProviderData  type exposes the following members.
 Properties
Name  |   Description
FrameworkElement
 The Windows Presentation Framework object containing the pane's user interface.
InitialState
 The initial position of the docking pane.
 See Also
  DockablePaneProviderData Class
  Autodesk.Revit.UI Namespace